# Before you start :
   - These exercises are related to the Subsetting and Descriptive Stats lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the `your-code` folder of this lab.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary

In [35]:
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt
import seaborn as sns

# Challenge 1

#### In this challenge we will use the `Temp_States.csv` file. 

#### First import it into a data frame called `temp`.

In [36]:
temp = pd.read_csv('/home/julian/Cursos/Ironhack/Labs/lab-descriptive-stats/your-code/Temp_States.csv')

#### Print `temp`

In [37]:
temp.head()

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444

#### Explore the data types of the Temp dataframe. What type of data do we have? Comment your result.

In [38]:
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

#### Select the rows where state is New York

In [39]:
temp.State

0       New York
1       New York
2       New York
3    Connecticut
4    Connecticut
5     New Jersey
6     New Jersey
Name: State, dtype: object

In [40]:
ny = temp[temp.State == 'New York']

In [41]:
ny

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average of the temperature of cities in New York?

In [42]:
ny.Temperature.mean()

10.74074074074074

#### We want to know cities and states with Temperature above 15 degress Celcius

In [43]:
temp[temp.Temperature > 15]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degress Celcius

In [44]:
temp.City.loc[temp.Temperature > 15]

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

#### We want to know which cities have a temperature above 15 degrees Celcius and below 20 degrees Celcius

*Hint: First write the condition then select the rows.*

In [45]:
temp.City.loc[(temp.Temperature > 15) & (temp.Temperature < 20)]

0         NYC
3    Hartford
Name: City, dtype: object

#### Find the mean and the standard deviation of the temperature of each state.

*Hint: Use functions from Data Manipulation lesson*

In [46]:
temp.groupby('State').mean()

             Temperature
State
Connecticut    15.833333
New Jersey     21.111111
New York       10.740741

In [48]:
temp.groupby('State').std()

             Temperature
State
Connecticut     1.964186
New Jersey      1.571348
New York        8.133404

In [49]:
temp_descr = temp.groupby('State').agg({'Temperature': [np.mean, np.std]})

In [50]:
temp_descr

            Temperature
                   mean       std
State
Connecticut   15.833333  1.964186
New Jersey    21.111111  1.571348
New York      10.740741  8.133404

# Challenge 2

#### Load the `employee.csv` file into a DataFrame. Call the dataframe `employee`

In [51]:
employee = pd.read_csv('/home/julian/Cursos/Ironhack/Labs/lab-descriptive-stats/your-code/Employee.csv')

In [52]:
employee.head()

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55

#### Explore the data types of the Temp dataframe. Comment your results

In [53]:
employee.dtypes

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

In [59]:
employee.shape

(9, 7)

#### Show visually the frequency distribution (histogram) of the employee dataset. In few words describe these histograms?

In [60]:
#sns.histplot(x=employee.Years)

#### What's the average salary in this company?

In [65]:
avg_salary = employee.Salary.mean()
avg_salary

48.888888888888886

#### What's the highest salary?

In [67]:
max_salary = employee.Salary.max()
max_salary

70

#### What's the lowest salary?

In [68]:
min_salary = employee.Salary.min()
min_salary

30

#### Who are the employees with the lowest salary?

In [71]:
employee.Name[employee.Salary == 30]

1    Maria
2    David
Name: Name, dtype: object

#### Could you give all the information about an employee called David?

In [72]:
employee.loc[employee.Name == 'David']

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you give only David's salary?

In [74]:
employee.loc[employee.Name == 'David'].Salary

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate

In [76]:
employee[employee.Title == 'associate']

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe

##### Tip : There are 2 ways to do it. Do it both ways

In [77]:
employee.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [79]:
employee.iloc[0:3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees who's title is associate and the salary above 55?

In [81]:
employee.loc[(employee.Title == 'associate') & (employee.Salary > 55)]

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees based on their number of years of employment. What are the average salaries in each group?

In [83]:
employee.groupby('Years').agg({'Salary': [np.average]})

          Salary
         average
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average Salary per title?

In [85]:
employee.groupby('Title').agg({'Salary': [np.average]})

              Salary
             average
Title
VP         70.000000
analyst    32.500000
associate  56.666667

#### Show a visual summary of the data using boxplot. What Are the First and Third Quartiles? Comment your results.
##### * Hint : Quantiles vs Quartiles*
##### - `In Probability and Statistics, quantiles are cut points dividing the range of a probability distribution into continuous intervals with equal probabilities. When division is into four parts the values of the variate corresponding to 25%, 50% and 75% of the total distribution are called quartiles.`

In [89]:
#sns.boxplot(x='Years', data=employee)

In [93]:
#sns.boxplot(x='Salary', data=employee)

#### Is the mean salary per gender different?

In [94]:
employee.groupby('Gender').agg({'Salary': [np.average]})

        Salary
       average
Gender
F         47.5
M         50.0

#### Find the minimum, mean and the maximum of all numeric columns for each Department.

##### Hint: Use functions from Data Manipulation lesson

In [95]:
employee.groupby('Department').agg({'Years':[np.average, np.min, np.max], 'Salary': [np.average, np.min, np.max]})

               Years            Salary
             average amin amax average amin amax
Department
HR          4.666667    2    8   45.00   30   70
IT          4.500000    1    8   48.75   30   70
Sales       2.500000    2    3   55.00   55   55

### Bonus Question

#### For each department, compute the difference between the maximal salary and the minimal salary.

##### * Hint: try using `agg` or `apply` and `lambda`*

In [97]:
employee.groupby('Department', as_index=False).agg({'Salary': lambda x: max(x) - min(x)})

  Department  Salary
0         HR      40
1         IT      40
2      Sales       0

# Challenge 3

#### Open the Orders.csv dataset. Name your dataset orders

In [98]:
orders = pd.read_csv('/home/julian/Cursos/Ironhack/Labs/lab-descriptive-stats/your-code/Orders.csv')

#### Explore your dataset by looking at the data types and the summary statistics. Comment your results

In [107]:
orders.shape

(397924, 14)

In [105]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397924 entries, 0 to 397923
Data columns (total 14 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   Unnamed: 0    397924 non-null  int64
 1   InvoiceNo     397924 non-null  int64
 2   StockCode     397924 non-null  object
 3   year          397924 non-null  int64
 4   month         397924 non-null  int64
 5   day           397924 non-null  int64
 6   hour          397924 non-null  int64
 7   Description   397924 non-null  object
 8   Quantity      397924 non-null  int64
 9   InvoiceDate   397924 non-null  object
 10  UnitPrice     397924 non-null  float64
 11  CustomerID    397924 non-null  int64
 12  Country       397924 non-null  object
 13  amount_spent  397924 non-null  float64
dtypes: float64(2), int64(8), object(4)
memory usage: 42.5+ MB

In [101]:
orders.describe()

,Unnamed: 0,InvoiceNo,year,month,day,hour,Quantity,UnitPrice,CustomerID,amount_spent
count,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000
mean,278465.221859,560617.126645,2010.934259,7.612537,3.614555,12.728247,13.021823,3.116174,15294.315171,22.394749
std,152771.368303,13106.167695,0.247829,3.416527,1.928274,2.273535,180.420210,22.096788,1713.169877,309.055588
min,0.000000,536365.000000,2010.000000,1.000000,1.000000,6.000000,1.000000,0.000000,12346.000000,0.000000
25%,148333.750000,549234.000000,2011.000000,5.000000,2.000000,11.000000,2.000000,1.250000,13969.000000,4.680000
50%,284907.500000,561893.000000,2011.000000,8.000000,3.000000,13.000000,6.000000,1.950000,15159.000000,11.800000
75%,410079.250000,572090.000000,2011.000000,11.000000,5.000000,14.000000,12.000000,3.750000,16795.000000,19.800000
max,541908.000000,581587.000000,2011.000000,12.000000,7.000000,20.000000,80995.000000,8142.750000,18287.000000,168469.600000

####  What is the average Purchase Price?

#### What were the highest and lowest purchase prices?

#### Select all the customers we have in Spain

#### How many customers do we have in Spain?
##### Hint : Use value_counts()

#### Select all the customers who have bought more than 50 items ?

#### Select orders from Spain that are above 50 items

#### Select all free orders

#### Select all orders that are 'lunch bag'
#### Hint: Use string functions

#### Select all orders that are made in 2011 and are 'lunch bag'

#### Show the frequency distribution of the amount spent in Spain.

#### Select all orders made in the month of August

#### Select how many orders are made by countries in the month of August
##### Hint: Use value_counts()

#### What's the  average amount of money spent by country

#### What's the most expensive item?

#### What was the average amount spent per year ?